# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # Ubah sesuai jumlah kelas Anda
scales: 
  n: [0.50, 0.25, 1024] 
  s: [0.50, 0.50, 1024] 
  m: [0.50, 1.00, 512] 
  l: [1.00, 1.00, 512] 
  x: [1.00, 1.50, 512] 

# YOLO11n Backbone + GhostConv
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 
  # Downsampling layers diganti GhostConv
  - [-1, 1, GhostConv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, GhostConv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, GhostConv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, GhostConv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10
  # CBAM Backbone (Global Context)
  - [-1, 1, CBAM, [1024, 7]] # 11 (P5 Backbone Output)

# YOLO11n + CBAM
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 6], 1, Concat, [1]] # 13. Cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]] # 16. Cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 17 (Proses P3)
  - [-1, 1, CBAM, [256, 7]] # 18 (P3 Attention - Small Object Focus)

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 14], 1, Concat, [1]] # 20. Cat head P4
  - [-1, 2, C3k2, [512, False]] # 21
  - [-1, 1, CBAM, [512, 7]] # 22 (P4 Attention - Medium Object Focus)

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 11], 1, Concat, [1]] # 24. Cat head P5 (Layer 11 adalah CBAM Backbone)
  - [-1, 2, C3k2, [1024, True]] # 25 (P5 Besar)

  # 18: P3 (Small - dengan CBAM)
  # 22: P4 (Medium - dengan CBAM)
  # 25: P5 (Large - tanpa CBAM tambahan di neck, cukup dari backbone)
  - [[18, 22, 25], 1, Detect, [nc]] # 26